; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	spectrograph1 - mode
	image0 - mode
	thermograph3 - mode
	spectrograph2 - mode
	thermograph5 - mode
	thermograph4 - mode
	Star3 - direction
	Star0 - direction
	Star4 - direction
	GroundStation1 - direction
	Star5 - direction
	GroundStation2 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Star13 - direction
	Star14 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph4)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star3)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star0)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
	(supports instrument2 thermograph4)
	(supports instrument2 spectrograph2)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph5)
	(calibration_target instrument3 Star4)
	(supports instrument4 thermograph4)
	(calibration_target instrument4 Star5)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument5 image0)
	(supports instrument5 thermograph5)
	(calibration_target instrument5 GroundStation1)
	(supports instrument6 thermograph3)
	(supports instrument6 spectrograph1)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star5)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet6)
)
(:goal (and
	(pointing satellite0 Star4)
	(pointing satellite1 GroundStation1)
	(pointing satellite2 GroundStation1)
	(have_image Planet6 thermograph4)
	(have_image Planet6 spectrograph2)
	(have_image Phenomenon7 spectrograph2)
	(have_image Phenomenon7 thermograph3)
	(have_image Phenomenon8 spectrograph1)
	(have_image Phenomenon8 spectrograph2)
	(have_image Star9 thermograph4)
	(have_image Star9 spectrograph1)
	(have_image Phenomenon10 image0)
	(have_image Phenomenon11 thermograph5)
	(have_image Phenomenon11 spectrograph1)
	(have_image Star12 spectrograph1)
	(have_image Star13 image0)
	(have_image Star14 image0)
))

)

; plan
1. (turn_to satellite2 groundstation1 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 groundstation1)
   goals met: 1 of 17
2. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 1 of 17
3. (calibrate satellite2 instrument5 groundstation1)
   added: (calibrated instrument5)
   goals met: 1 of 17
4. (turn_to satellite2 star14 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star14)
   goals met: 0 of 17
5. (take_image satellite2 star14 instrument5 image0)
   added: (have_image star14 image0)
   goals met: 1 of 17
6. (turn_to satellite2 star13 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star13)
   goals met: 1 of 17
7. (take_image satellite2 star13 instrument5 image0)
   added: (have_image star13 image0)
   goals met: 2 of 17
8. (turn_to satellite2 phenomenon11 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 phenomenon11)
   goals met: 2 of 17
9. (take_image satellite2 phenomenon11 instrument5 thermograph5)
   added: (have_image phenomenon11 thermograph5)
   goals met: 3 of 17
10. (turn_to satellite2 phenomenon10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 phenomenon10)
   goals met: 3 of 17
11. (take_image satellite2 phenomenon10 instrument5 image0)
   added: (have_image phenomenon10 image0)
   goals met: 4 of 17
12. (turn_to satellite2 groundstation1 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 groundstation1)
   goals met: 5 of 17
13. (turn_to satellite1 groundstation1 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 groundstation1)
   goals met: 6 of 17
14. (turn_to satellite0 star0 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star0)
   goals met: 6 of 17
15. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 6 of 17
16. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 6 of 17
17. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 6 of 17
18. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 6 of 17
19. (turn_to satellite0 phenomenon7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon7)
   goals met: 6 of 17
20. (take_image satellite0 phenomenon7 instrument1 thermograph3)
   added: (have_image phenomenon7 thermograph3)
   goals met: 7 of 17
21. (turn_to satellite0 star4 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star4)
   goals met: 8 of 17
22. (turn_to satellite1 phenomenon11 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon11)
   goals met: 7 of 17
23. (take_image satellite1 phenomenon11 instrument2 spectrograph1)
   added: (have_image phenomenon11 spectrograph1)
   goals met: 8 of 17
24. (turn_to satellite1 phenomenon7 phenomenon11)
   deleted: (pointing satellite1 phenomenon11)
   added: (pointing satellite1 phenomenon7)
   goals met: 8 of 17
25. (take_image satellite1 phenomenon7 instrument2 spectrograph2)
   added: (have_image phenomenon7 spectrograph2)
   goals met: 9 of 17
26. (turn_to satellite1 phenomenon8 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 phenomenon8)
   goals met: 9 of 17
27. (take_image satellite1 phenomenon8 instrument2 spectrograph1)
   added: (have_image phenomenon8 spectrograph1)
   goals met: 10 of 17
28. (take_image satellite1 phenomenon8 instrument2 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 11 of 17
29. (turn_to satellite1 planet6 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 planet6)
   goals met: 11 of 17
30. (take_image satellite1 planet6 instrument2 spectrograph2)
   added: (have_image planet6 spectrograph2)
   goals met: 12 of 17
31. (take_image satellite1 planet6 instrument2 thermograph4)
   added: (have_image planet6 thermograph4)
   goals met: 13 of 17
32. (turn_to satellite1 star12 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star12)
   goals met: 13 of 17
33. (take_image satellite1 star12 instrument2 spectrograph1)
   added: (have_image star12 spectrograph1)
   goals met: 14 of 17
34. (turn_to satellite1 star9 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star9)
   goals met: 14 of 17
35. (take_image satellite1 star9 instrument2 spectrograph1)
   added: (have_image star9 spectrograph1)
   goals met: 15 of 17
36. (take_image satellite1 star9 instrument2 thermograph4)
   added: (have_image star9 thermograph4)
   goals met: 16 of 17
37. (turn_to satellite1 groundstation1 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 groundstation1)
   goals met: 17 of 17
